{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v4.4.0",
  "convertedBy": "TensorFlow.js Converter v2.8.0",
  "modelTopology": {
    "keras_version": "2.10.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "emergency_sound_classifier",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 200, 128, 1],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "filters": 16,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "activation": "relu",
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "use_bias": true
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "max_pooling2d_1",
              "trainable": true,
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "units": 64,
              "activation": "relu",
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "use_bias": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "units": 1,
              "activation": "sigmoid",
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "use_bias": true
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "conv2d_1/kernel",
          "shape": [3, 3, 1, 16],
          "dtype": "float32"
        },
        {
          "name": "conv2d_1/bias",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [320000, 64],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [64],
          "dtype": "float64"
        },
        {
          "name": "dense_2/kernel",
          "shape": [64, 1],
          "dtype": "float64"
        },
        {
          "name": "dense_2/bias",
          "shape": [1],
          "dtype": "float64"
        }
      ]
    }
  ],
  "userDefinedMetadata": {
    "description": "CNN for emergency sound detection",
    "input_shape": [200, 128, 1],
    "classes": ["emergency", "non-emergency"]
  }
}
